"%@ - 待实现" = "%@ - Coming Soon";
"%@ -- %lu 个表" = "%@ — %lu tables";
"%@ . %@ -- %lu 行" = "%@ . %@ — %lu rows";
"%@ 安装成功" = "%@ installed";
"%lu 个项目" = "%lu items";
"... 等 %lu 项" = "... %lu items";
"> 开始" = "> Start";
"IM会话监控" = "IM Session";
"JSON 格式错误: %@" = "JSON format error: %@";
"Lockdown 握手失败" = "Lockdown handshake failed";
"Lockdown 握手失败，请确认设备已信任此电脑" = "Lockdown handshake failed, trust this computer on device";
"MMKV数据" = "MMKV Data";
"Mock 规则" = "Mock Rules";
"SQLite浏览器" = "SQLite Browser";
"UserDefault数据" = "UserDefaults";
"WiFi 地址" = "WiFi Address";
"[信息] Bundle ID: %@" = "[Info] Bundle ID: %@";
"[信息] 关键字: %@" = "[Info] Keyword: %@";
"[信息] 启动模拟器日志流 (UDID: %@)" = "[Info] Starting simulator log stream (UDID: %@)";
"[信息] 已连接，等待日志..." = "[Info] Connected, waiting for logs...";
"[信息] 已连接，等待日志…" = "[Info] Connected, waiting for logs...";
"[信息] 日志流已断开" = "[Info] Log stream disconnected";
"[信息] 模拟器日志流已关闭" = "[Info] Simulator log stream closed";
"[错误] syslog_relay 启动失败: %d" = "[Error] syslog_relay start failed: %d";
"[错误] 启动失败: %@" = "[Error] Start failed: %@";
"[错误] 无效的模拟器 UDID" = "[Error] Invalid simulator UDID";
"[错误] 无效的设备 UDID" = "[Error] Invalid device UDID";
"[错误] 无法连接设备" = "[Error] Cannot connect to device";
"[错误] 请先选择设备" = "[Error] Select a device first";
"\\n... 等 %lu 项" = "\\n... %lu items";
"iOS 模拟器" = "iOS Simulator";
"lockdown handshake 失败" = "Lockdown handshake failed";
"← 返回" = "← Back";
"↑ 上传" = "↑ Upload";
"↓ 下载" = "↓ Download";
"↻ 刷新" = "↻ Refresh";
"⏸ 停止" = "Stop";
"■ 停止" = "Stop";
"▶ 开始" = "Start";
"☑ 勾选控制侧边栏可见" = "☑ Toggle sidebar visibility";
"✎ 编辑" = "Edit";
"✕ 删除" = "✕ Delete";
"➕ 刷新" = "➕ Refresh";
"下载中: %@ ..." = "Downloading: %@ ...";
"下载失败: %@" = "Download failed: %@";
"保存" = "Save";
"保存中..." = "Saving...";
"保存中…" = "Saving...";
"保存失败: %@" = "Save failed: %@";
"保存截屏" = "Save Screenshot";
"修改时间" = "Modified";
"值" = "Value";
"停止" = "Stop";
"共 %lu 个应用" = "%lu apps";
"共 %lu 个数据库" = "%lu databases";
"共 %lu 条记录" = "%lu records";
"关键字..." = "Keyword...";
"写入设备文件失败" = "Failed to write device file";
"创建" = "Create";
"创建失败: %@" = "Create failed: %@";
"删除" = "Delete";
"删除 \"%@\" ?" = "Delete \"%@\"?";
"删除中..." = "Deleting...";
"删除中…" = "Deleting...";
"删除失败: %@" = "Delete failed: %@";
"删除表 \"%@\" 中第 %ld 行数据？此操作不可撤销。" = "Delete row %ld from \"%@\"? This cannot be undone.";
"功能列表" = "Features";
"功能列表设置" = "Feature List Settings";
"加载中..." = "Loading...";
"加载中…" = "Loading...";
"发送" = "Send";
"发送失败: %@" = "Send failed: %@";
"取消" = "Cancel";
"名称" = "Name";
"名称 *:" = "Name *:";
"名称不能为空" = "Name cannot be empty";
"响应体" = "Resp Body";
"响应头" = "Resp Headers";
"埋点监控" = "Analytics";
"大小" = "Size";
"安装失败: %@" = "Install failed: %@";
"安装请求失败 (code %d)" = "Install request failed (code %d)";
"安装超时或失败" = "Install timeout or failed";
"将删除:%@" = "Will delete: %@";
"属性" = "Property";
"崩溃日志" = "Crash Logs";
"已下载: %@" = "Downloaded: %@";
"已保存到 %@" = "Saved to %@";
"已连接 | %lu 请求 | %lu Mock" = "Connected | %lu requests | %lu mocks";
"已连接到 App" = "Connected to App";
"已连接，点击截屏" = "Connected, click to capture";
"已连接，编辑 JSON 后点击发送" = "Connected, edit JSON and send";
"序列号" = "Serial Number";
"应用列表" = "App List";
"应用名称" = "App Name";
"应用扫描超时，请重试" = "App scan timeout, retry";
"必填，同一URL可用不同名称区分" = "Required, use different names for same URL";
"截屏" = "Capture";
"截屏失败：收到空数据" = "Capture failed: empty data";
"截屏失败：无法解析图像数据" = "Capture failed: cannot parse image";
"截屏成功 — %.0f × %.0f 像素" = "Captured — %.0f × %.0f px";
"扫描中..." = "Scanning...";
"扫描中…" = "Scanning...";
"推送 Payload (JSON):" = "Push Payload (JSON):";
"推送内容" = "Push Content";
"推送已送达 AppDelegate" = "Push delivered to AppDelegate";
"推送标题" = "Push Title";
"操作成功" = "Operation succeeded";
"操作系统与版本" = "OS Version";
"数据库" = "Database";
"文件不存在" = "File not found";
"文件夹" = "Folder";
"文件夹名称" = "Folder name";
"新增" = "Add";
"新增数据行" = "New Row";
"新建文件夹" = "New Folder";
"无数据库文件" = "No database files";
"无法创建 AFC 客户端" = "Cannot create AFC client";
"无法创建 installation_proxy 客户端" = "Cannot create installation_proxy client";
"无法创建设备目录: %@" = "Cannot create device directory: %@";
"无法启动 AFC 服务" = "Cannot start AFC service";
"无法启动 installation_proxy 服务" = "Cannot start installation_proxy service";
"无法在设备上创建文件: %@" = "Cannot create file on device: %@";
"无法获取行标识" = "Cannot get row identifier";
"无法读取 .app 目录内容" = "Cannot read .app directory contents";
"无法读取本地文件" = "Cannot read local file";
"无法连接设备" = "Cannot connect to device";
"日志监控" = "Log Monitor";
"未找到App" = "No app found";
"未检测到设备" = "No device detected";
"未知错误" = "Unknown error";
"未获取到应用或设备未连接" = "No apps or device not connected";
"未连接" = "Not connected";
"未连接 -- 请先选择设备 -> 选择 App" = "Not connected — select device → app";
"未连接 — 请先选择设备 → 选择 App" = "Not connected — select device → app";
"未连接设备或无法获取设备信息" = "Not connected or cannot get device info";
"未连接，请先在 iOS 设备上启动 App 并连接" = "Not connected, launch the app on iOS device";
"未连接，请先连接设备" = "Not connected, connect device first";
"查看/修改" = "View/Edit";
"模拟器" = "Simulator";
"正在加载应用列表..." = "Loading app list...";
"正在加载应用列表…" = "Loading app list...";
"正在加载数据库列表..." = "Loading database list...";
"正在加载数据库列表…" = "Loading database list...";
"正在加载设备信息..." = "Loading device info...";
"正在加载设备信息…" = "Loading device info...";
"正在发送..." = "Sending...";
"正在发送…" = "Sending...";
"正在安装 %@ ..." = "Installing %@ ...";
"正在截屏..." = "Capturing...";
"正在截屏…" = "Capturing...";
"正在检测连接..." = "Detecting connection...";
"正在检测连接…" = "Detecting connection...";
"正在连接设备...\\n" = "Connecting to device...\\n";
"正在连接设备…\\n" = "Connecting to device...\\n";
"沙盒管理" = "Sandbox";
"消息推送" = "Push";
"清空" = "Clear";
"灰度任务" = "Grayscale Tasks";
"点击 > 开始捕获日志\\n" = "Click > to start capturing logs\\n";
"点击 ▶ 开始捕获日志\\n" = "Click ▶ to start capturing logs\\n";
"热修复" = "Hotfix";
"版本" = "Version";
"状态" = "State";
"环境切换" = "Environment";
"确定" = "OK";
"确认删除" = "Confirm Delete";
"类型" = "Type";
"类型:" = "Type:";
"编解码" = "Codec";
"编辑" = "Edit";
"网络监控" = "Network Monitor";
"自动滚屏" = "Auto Scroll";
"表: %@" = "Table: %@";
"解析xlog" = "Parse xlog";
"解析日志文件" = "Parse Logs";
"设备信息" = "Device Info";
"设备号 (UDID)" = "UDID";
"设备名称" = "Device Name";
"设备型号" = "Device Model";
"设备截屏" = "Screenshot";
"设备扫描超时，请重试" = "Device scan timeout, retry";
"设备类型" = "Device Type";
"该表无可插入字段" = "No insertable fields in table";
"请先连接设备并选择数据库" = "Connect and select a database";
"请先选择设备" = "Select a device first";
"请先选择设备后再拖拽安装" = "Select a device before installing";
"请求体" = "Req Body";
"请求头" = "Req Headers";
"请求详情：" = "Request Detail:";
"请输入 JSON payload" = "Enter JSON payload";
"请选择应用" = "Select App";
"请选择连接设备" = "Select a device to connect";
"路由校验" = "Route Check";
"输入 %@ ..." = "Enter %@ ...";
"输入 %@ …" = "Enter %@ …";
"连接已断开" = "Disconnected";
"连接设备" = "Connect Device";
"选择App" = "Select App";
"选择数据库..." = "Select database...";
"选择数据库…" = "Select database...";
"选择表..." = "Select table...";
"选择表…" = "Select table...";
"错误: %@" = "Error: %@";
"＋ 新建文件夹" = "＋ New Folder";
"＋ 行" = "＋ Row";
"－ 行" = "－ Row";
